## Terraform Run Output 🤖
    
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

$ terraform validate
Success! The configuration is valid.

```

</details>

#### Plan 📖`success`
* **Plan: 4 to add, 22 to change, 4 to destroy.**

<details><summary>Show Plan</summary>

```

$ terraform plan
local_file.ansible_inventory: Refreshing state... [id=ab094adabd3ba9227beb2fc69d596fbaa80c9cfa]
null_resource.ansible_update_known_hosts: Refreshing state... [id=4418919173081010018]
module.network.data.aws_availability_zones.available: Reading...
aws_cloudwatch_log_group.app: Refreshing state... [id=tf-ecs-group/app-dataapi]
aws_acm_certificate.ooniapi: Refreshing state... [id=arn:aws:acm:eu-central-1:082866812839:certificate/6d4750e5-cfc2-4ab6-b962-74ea2371206e]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-central-1:082866812839:cluster/ooni-ecs-cluster]
module.terraform_state_backend.data.aws_region.current: Reading...
module.terraform_state_backend.aws_s3_bucket.default[0]: Refreshing state... [id=ooni-production-terraform-state]
module.network.aws_vpc.main: Refreshing state... [id=vpc-08b101405472a0b46]
module.terraform_state_backend.aws_dynamodb_table.with_server_side_encryption[0]: Refreshing state... [id=ooni-production-terraform-state-lock]
aws_iam_policy.codepipeline_oonibackend: Refreshing state... [id=arn:aws:iam::082866812839:policy/service-role/codepipeline-oonibackend]
module.terraform_state_backend.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.terraform_state_backend.data.aws_iam_policy_document.bucket_policy[0]: Reading...
aws_iam_role.ecs_service: Refreshing state... [id=ooni_ecs_role]
module.terraform_state_backend.data.aws_iam_policy_document.bucket_policy[0]: Read complete after 0s [id=2050088263]
aws_iam_role.ecs_task: Refreshing state... [id=ooni_ecs_task_role]
aws_iam_policy.codebuild_oonidataapi: Refreshing state... [id=arn:aws:iam::082866812839:policy/service-role/codebuild-oonidataapi-eu-central-1]
aws_iam_role.app_instance: Refreshing state... [id=tf-ecs-ooni-instance-role]
module.ooni_backendproxy.data.aws_ssm_parameter.ubuntu_22_ami: Reading...
aws_cloudwatch_log_group.ecs: Refreshing state... [id=tf-ecs-group/ecs-agent]
module.network.data.aws_availability_zones.available: Read complete after 1s [id=eu-central-1]
aws_acm_certificate.oonidataapi: Refreshing state... [id=arn:aws:acm:eu-central-1:082866812839:certificate/594dd1ab-3b41-4052-bce2-4ee41ddd297c]
data.aws_ssm_parameter.ecs_optimized_ami: Reading...
module.terraform_state_backend.data.aws_iam_policy_document.aggregated_policy[0]: Reading...
module.terraform_state_backend.data.aws_iam_policy_document.aggregated_policy[0]: Read complete after 0s [id=2050088263]
aws_iam_role.codepipeline_oonibackend: Refreshing state... [id=codepipeline-oonibackend]
aws_iam_role_policy.ecs_task: Refreshing state... [id=ooni_ecs_task_role:ooni_ecs_task_policy]
aws_iam_role_policy.ecs_service: Refreshing state... [id=ooni_ecs_role:ooni_ecs_policy]
aws_iam_role.codebuild_oonidataapi: Refreshing state... [id=codebuild-oonibackend]
aws_iam_role_policy.instance: Refreshing state... [id=tf-ecs-ooni-instance-role:TfEcsOONIInstanceRole]
aws_iam_instance_profile.app: Refreshing state... [id=tf-ecs-instprofile]
aws_route53_record.ooniapi_cert_validation["api.prod.ooni.io"]: Refreshing state... [id=Z02418652BOD91LFA5S9X__e6204670c90aeb5503fecfa9fc82cfb7.api.prod.ooni.io._CNAME]
module.ooni_backendproxy.data.aws_ssm_parameter.ubuntu_22_ami: Read complete after 0s [id=/aws/service/canonical/ubuntu/server/22.04/stable/current/amd64/hvm/ebs-gp2/ami-id]
aws_ecs_task_definition.oonidataapi: Refreshing state... [id=ooni-dataapi-production-td]
aws_codebuild_project.oonidataapi: Refreshing state... [id=arn:aws:codebuild:eu-central-1:082866812839:project/oonidataapi]
data.aws_ssm_parameter.ecs_optimized_ami: Read complete after 0s [id=/aws/service/ecs/optimized-ami/amazon-linux-2/recommended]
aws_route53_record.oonidataapi_cert_validation["dataapi.prod.ooni.io"]: Refreshing state... [id=Z02418652BOD91LFA5S9X__74a0d0e91f58697b6838bed5a2fb4939.dataapi.prod.ooni.io._CNAME]
aws_acm_certificate_validation.ooniapi: Refreshing state... [id=2024-03-07 16:01:36.287 +0000 UTC]
aws_codepipeline.oonidataapi: Refreshing state... [id=oonidataapi]
module.network.aws_internet_gateway.gw: Refreshing state... [id=igw-05319878d828e0a53]
module.network.aws_subnet.main[0]: Refreshing state... [id=subnet-06d47d18b015109d4]
module.network.aws_subnet.main[1]: Refreshing state... [id=subnet-02241f60bd951358d]
aws_alb_target_group.oonidataapi: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:082866812839:targetgroup/ooni-tier1-oonidataapi/8e097b6520cea730]
aws_alb_target_group.oonibackend_proxy: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:082866812839:targetgroup/ooni-tier0-oldbackend-proxy/4cb68d50e9943a36]
module.postgresql.aws_security_group.pg: Refreshing state... [id=sg-06d7cf832e6855a37]
aws_security_group.lb_sg: Refreshing state... [id=sg-090ff83a71e7ad235]
module.ooni_backendproxy.aws_security_group.nginx_sg: Refreshing state... [id=sg-0c240bbfa7adaa0d3]
module.network.aws_route_table.r: Refreshing state... [id=rtb-06814accd93aca9ce]
module.terraform_state_backend.aws_s3_bucket_versioning.default[0]: Refreshing state... [id=ooni-production-terraform-state]
module.terraform_state_backend.aws_s3_bucket_server_side_encryption_configuration.default[0]: Refreshing state... [id=ooni-production-terraform-state]
module.terraform_state_backend.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=ooni-production-terraform-state]
module.network.aws_route_table_association.a[1]: Refreshing state... [id=rtbassoc-034c4831c1754e284]
module.network.aws_route_table_association.a[0]: Refreshing state... [id=rtbassoc-049f8c5e84cb32e55]
aws_alb.ooniapi: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:082866812839:loadbalancer/app/ooni-tier0-api/49be6e080d45721f]
aws_security_group.instance_sg: Refreshing state... [id=sg-0f39450a61732d69b]
aws_alb.oonidataapi: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:082866812839:loadbalancer/app/ooni-tier1-oonidataapi/ea60c354721e5a7f]
module.postgresql.aws_db_subnet_group.pg: Refreshing state... [id=ooni-main]
module.ooni_backendproxy.aws_launch_template.ooni_backendproxy: Refreshing state... [id=lt-0274733f40bb485de]
module.terraform_state_backend.aws_s3_bucket_policy.default[0]: Refreshing state... [id=ooni-production-terraform-state]
aws_launch_template.app: Refreshing state... [id=lt-01b923563af0432b5]
module.terraform_state_backend.time_sleep.wait_for_aws_s3_bucket_settings[0]: Refreshing state... [id=2024-02-02T21:32:23Z]
module.terraform_state_backend.aws_s3_bucket_ownership_controls.default[0]: Refreshing state... [id=ooni-production-terraform-state]
module.ooni_backendproxy.aws_autoscaling_group.oonibackend_proxy: Refreshing state... [id=ooni-tier0-prod-oldbackend-proxy20240307170248128500000001]
aws_autoscaling_group.app: Refreshing state... [id=ooni-tier1-production-backend-asg20240119184843559900000002]
aws_route53_record.ooniapi_alb_dns: Refreshing state... [id=Z02418652BOD91LFA5S9X_api.prod.ooni.io_A]
aws_alb_listener.ooniapi_listener_https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:082866812839:listener/app/ooni-tier0-api/49be6e080d45721f/24a37a3dd65d6fc2]
aws_alb_listener.ooniapi_listener_http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:082866812839:listener/app/ooni-tier0-api/49be6e080d45721f/2ea57998d9ec749f]
aws_route53_record.alb_dns: Refreshing state... [id=Z02418652BOD91LFA5S9X_dataapi.prod.ooni.io_A]
aws_alb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:082866812839:listener/app/ooni-tier1-oonidataapi/ea60c354721e5a7f/e6f312f0d4dae4d0]
aws_acm_certificate_validation.oonidataapi: Refreshing state... [id=2024-03-07 16:01:33.031 +0000 UTC]
module.postgresql.aws_db_instance.pg: Refreshing state... [id=db-LT4NDHTMMWPYB4TLALUJMYTZFU]
aws_autoscaling_attachment.oonibackend_proxy: Refreshing state... [id=ooni-tier0-prod-oldbackend-proxy20240307170248128500000001-20240307171825614900000001]
aws_alb_listener.front_end_https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:082866812839:listener/app/ooni-tier1-oonidataapi/ea60c354721e5a7f/40d3c7d15b31b706]
aws_route53_record.postgres_dns: Refreshing state... [id=Z035992527R8VEIX2UVO0_postgres.tier0.prod.ooni.nu_CNAME]
aws_ecs_service.oonidataapi: Refreshing state... [id=arn:aws:ecs:eu-central-1:082866812839:service/ooni-ecs-cluster/ooni-ecs-dataapi-production]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.ooniapi will be updated in-place
  ~ resource "aws_acm_certificate" "ooniapi" {
        id                        = "arn:aws:acm:eu-central-1:082866812839:certificate/6d4750e5-cfc2-4ab6-b962-74ea2371206e"
      ~ tags                      = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all                  = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_acm_certificate.oonidataapi will be updated in-place
  ~ resource "aws_acm_certificate" "oonidataapi" {
        id                        = "arn:aws:acm:eu-central-1:082866812839:certificate/594dd1ab-3b41-4052-bce2-4ee41ddd297c"
      ~ tags                      = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all                  = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_alb.ooniapi will be updated in-place
  ~ resource "aws_alb" "ooniapi" {
        id                                          = "arn:aws:elasticloadbalancing:eu-central-1:082866812839:loadbalancer/app/ooni-tier0-api/49be6e080d45721f"
        name                                        = "ooni-tier0-api"
      ~ tags                                        = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all                                    = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_alb.oonidataapi will be updated in-place
  ~ resource "aws_alb" "oonidataapi" {
        id                                          = "arn:aws:elasticloadbalancing:eu-central-1:082866812839:loadbalancer/app/ooni-tier1-oonidataapi/ea60c354721e5a7f"
        name                                        = "ooni-tier1-oonidataapi"
      ~ tags                                        = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all                                    = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_alb_listener.front_end will be updated in-place
  ~ resource "aws_alb_listener" "front_end" {
        id                = "arn:aws:elasticloadbalancing:eu-central-1:082866812839:listener/app/ooni-tier1-oonidataapi/ea60c354721e5a7f/e6f312f0d4dae4d0"
      ~ tags              = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all          = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_alb_listener.front_end_https will be updated in-place
  ~ resource "aws_alb_listener" "front_end_https" {
        id                = "arn:aws:elasticloadbalancing:eu-central-1:082866812839:listener/app/ooni-tier1-oonidataapi/ea60c354721e5a7f/40d3c7d15b31b706"
      ~ tags              = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all          = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_listener.ooniapi_listener_http will be updated in-place
  ~ resource "aws_alb_listener" "ooniapi_listener_http" {
        id                = "arn:aws:elasticloadbalancing:eu-central-1:082866812839:listener/app/ooni-tier0-api/49be6e080d45721f/2ea57998d9ec749f"
      ~ tags              = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all          = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_alb_listener.ooniapi_listener_https will be updated in-place
  ~ resource "aws_alb_listener" "ooniapi_listener_https" {
        id                = "arn:aws:elasticloadbalancing:eu-central-1:082866812839:listener/app/ooni-tier0-api/49be6e080d45721f/24a37a3dd65d6fc2"
      ~ tags              = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all          = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_target_group.oonibackend_proxy will be updated in-place
  ~ resource "aws_alb_target_group" "oonibackend_proxy" {
        id                                 = "arn:aws:elasticloadbalancing:eu-central-1:082866812839:targetgroup/ooni-tier0-oldbackend-proxy/4cb68d50e9943a36"
        name                               = "ooni-tier0-oldbackend-proxy"
      ~ tags                               = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all                           = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_alb_target_group.oonidataapi will be updated in-place
  ~ resource "aws_alb_target_group" "oonidataapi" {
        id                                 = "arn:aws:elasticloadbalancing:eu-central-1:082866812839:targetgroup/ooni-tier1-oonidataapi/8e097b6520cea730"
        name                               = "ooni-tier1-oonidataapi"
      ~ tags                               = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all                           = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_cluster.main will be updated in-place
  ~ resource "aws_ecs_cluster" "main" {
        id       = "arn:aws:ecs:eu-central-1:082866812839:cluster/ooni-ecs-cluster"
        name     = "ooni-ecs-cluster"
      ~ tags     = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.oonidataapi will be updated in-place
  ~ resource "aws_ecs_service" "oonidataapi" {
        id                                 = "arn:aws:ecs:eu-central-1:082866812839:service/ooni-ecs-cluster/ooni-ecs-dataapi-production"
        name                               = "ooni-ecs-dataapi-production"
      ~ tags                               = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all                           = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.oonidataapi will be updated in-place
  ~ resource "aws_ecs_task_definition" "oonidataapi" {
        id                       = "ooni-dataapi-production-td"
      ~ tags                     = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all                 = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_instance_profile.app will be updated in-place
  ~ resource "aws_iam_instance_profile" "app" {
        id          = "tf-ecs-instprofile"
        name        = "tf-ecs-instprofile"
      ~ tags        = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all    = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role.app_instance will be updated in-place
  ~ resource "aws_iam_role" "app_instance" {
        id                    = "tf-ecs-ooni-instance-role"
        name                  = "tf-ecs-ooni-instance-role"
      ~ tags                  = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all              = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.ecs_service will be updated in-place
  ~ resource "aws_iam_role" "ecs_service" {
        id                    = "ooni_ecs_role"
        name                  = "ooni_ecs_role"
      ~ tags                  = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all              = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.ecs_task will be updated in-place
  ~ resource "aws_iam_role" "ecs_task" {
        id                    = "ooni_ecs_task_role"
        name                  = "ooni_ecs_task_role"
      ~ tags                  = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all              = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_launch_template.app will be updated in-place
  ~ resource "aws_launch_template" "app" {
      ~ default_version                      = 13 -> (known after apply)
        id                                   = "lt-01b923563af0432b5"
      ~ latest_version                       = 13 -> (known after apply)
        name                                 = "ooni-tier1-production-backend-lt20240120072522124000000001"
        tags                                 = {}
      ~ user_data                            = "IyEvYmluL2Jhc2gKCmNhdCA8PCdFT0YnID4+IC9ldGMvZWNzL2Vjcy5jb25maWcKRUNTX0NMVVNURVI9b29uaS1lY3MtY2x1c3RlcgpFQ1NfTE9HTEVWRUw9ZGVidWcKRUNTX0NPTlRBSU5FUl9JTlNUQU5DRV9UQUdTPXsiTmFtZSI6Im9vbmktdGllcjEtcHJvZHVjdGlvbiIsIlJlcG9zaXRvcnkiOiJodHRwczovL2dpdGh1Yi5jb20vb29uaS9kZXZvcHMifQpFQ1NfRU5BQkxFX1RBU0tfSUFNX1JPTEU9dHJ1ZQpFT0YKCg==" -> "IyEvYmluL2Jhc2gKCmNhdCA8PCdFT0YnID4+IC9ldGMvZWNzL2Vjcy5jb25maWcKRUNTX0NMVVNURVI9b29uaS1lY3MtY2x1c3RlcgpFQ1NfTE9HTEVWRUw9ZGVidWcKRUNTX0NPTlRBSU5FUl9JTlNUQU5DRV9UQUdTPXsiRW52aXJvbm1lbnQiOiJwcm9kIiwiTmFtZSI6Im9vbmktcHJvZCIsIlJlcG9zaXRvcnkiOiJodHRwczovL2dpdGh1Yi5jb20vb29uaS9kZXZvcHMifQpFQ1NfRU5BQkxFX1RBU0tfSUFNX1JPTEU9dHJ1ZQpFT0YKCg=="
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_security_group.instance_sg will be updated in-place
  ~ resource "aws_security_group" "instance_sg" {
        id                     = "sg-0f39450a61732d69b"
        name                   = "tf-ecs-instsg"
      ~ tags                   = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all               = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.lb_sg will be updated in-place
  ~ resource "aws_security_group" "lb_sg" {
        id                     = "sg-090ff83a71e7ad235"
        name                   = "tf-ecs-lbsg"
      ~ tags                   = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all               = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_internet_gateway.gw has moved to module.network.aws_internet_gateway.gw
    resource "aws_internet_gateway" "gw" {
        id       = "igw-05319878d828e0a53"
        tags     = {}
        # (4 unchanged attributes hidden)
    }

  # aws_route_table.r has moved to module.network.aws_route_table.r
    resource "aws_route_table" "r" {
        id               = "rtb-06814accd93aca9ce"
        tags             = {}
        # (6 unchanged attributes hidden)
    }

  # aws_route_table_association.a[0] has moved to module.network.aws_route_table_association.a[0]
    resource "aws_route_table_association" "a" {
        id             = "rtbassoc-049f8c5e84cb32e55"
        # (2 unchanged attributes hidden)
    }

  # aws_route_table_association.a[1] has moved to module.network.aws_route_table_association.a[1]
    resource "aws_route_table_association" "a" {
        id             = "rtbassoc-034c4831c1754e284"
        # (2 unchanged attributes hidden)
    }

  # aws_subnet.main[0] has moved to module.network.aws_subnet.main[0]
    resource "aws_subnet" "main" {
        id                                             = "subnet-06d47d18b015109d4"
        tags                                           = {}
        # (16 unchanged attributes hidden)
    }

  # aws_subnet.main[1] has moved to module.network.aws_subnet.main[1]
    resource "aws_subnet" "main" {
        id                                             = "subnet-02241f60bd951358d"
        tags                                           = {}
        # (16 unchanged attributes hidden)
    }

  # aws_vpc.main has moved to module.network.aws_vpc.main
    resource "aws_vpc" "main" {
        id                                   = "vpc-08b101405472a0b46"
        tags                                 = {}
        # (15 unchanged attributes hidden)
    }

  # module.ooni_backendproxy.aws_autoscaling_group.oonibackend_proxy will be updated in-place
  # (moved from aws_autoscaling_group.oonibackend_proxy)
  ~ resource "aws_autoscaling_group" "oonibackend_proxy" {
        id                               = "ooni-tier0-prod-oldbackend-proxy20240307170248128500000001"
        name                             = "ooni-tier0-prod-oldbackend-proxy20240307170248128500000001"
        # (27 unchanged attributes hidden)

      ~ launch_template {
          ~ id      = "lt-0274733f40bb485de" -> (known after apply)
            name    = "nginx-template-20240308075727243600000001"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ooni_backendproxy.aws_launch_template.ooni_backendproxy must be replaced
  # (moved from aws_launch_template.ooni_backendproxy)
+/- resource "aws_launch_template" "ooni_backendproxy" {
      ~ arn                     = "arn:aws:ec2:eu-central-1:082866812839:launch-template/lt-0274733f40bb485de" -> (known after apply)
      ~ default_version         = 1 -> (known after apply)
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      ~ id                      = "lt-0274733f40bb485de" -> (known after apply)
      ~ latest_version          = 1 -> (known after apply)
      ~ name                    = "nginx-template-20240308075727243600000001" -> (known after apply)
      ~ name_prefix             = "nginx-template-" -> "ooni-backendproxy-nginx-tmpl-" # forces replacement
      - security_group_names    = [] -> null
      - tags                    = {} -> null
      ~ tags_all                = {} -> (known after apply)
      - vpc_security_group_ids  = [] -> null
        # (4 unchanged attributes hidden)

      ~ network_interfaces {
          - device_index                = 0 -> null
          - ipv4_address_count          = 0 -> null
          - ipv4_addresses              = [] -> null
          - ipv4_prefix_count           = 0 -> null
          - ipv4_prefixes               = [] -> null
          - ipv6_address_count          = 0 -> null
          - ipv6_addresses              = [] -> null
          - ipv6_prefix_count           = 0 -> null
          - ipv6_prefixes               = [] -> null
          - network_card_index          = 0 -> null
          ~ security_groups             = [
              - "sg-0c240bbfa7adaa0d3",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ tag_specifications {
          - tags          = {
              - "Name" = "ooni-tier0-prod-backendproxy"
            } -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.ooni_backendproxy.aws_security_group.nginx_sg must be replaced
  # (moved from aws_security_group.ooni_nginx_sg)
+/- resource "aws_security_group" "nginx_sg" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:082866812839:security-group/sg-0c240bbfa7adaa0d3" -> (known after apply)
      ~ description            = "security group for OONI Nginx. Allow port 80 and 22" -> "security group for nginx" # forces replacement
      ~ id                     = "sg-0c240bbfa7adaa0d3" -> (known after apply)
      ~ name                   = "ooni-tier0-prod-nginx-sg" -> (known after apply)
      + name_prefix            = (known after apply)
      ~ owner_id               = "082866812839" -> (known after apply)
      - tags                   = {
          - "Name"       = "ooni-tier1-production"
          - "Repository" = "https://github.com/ooni/devops"
        } -> null
      ~ tags_all               = {
          - "Name"       = "ooni-tier1-production"
          - "Repository" = "https://github.com/ooni/devops"
        } -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.postgresql.aws_db_instance.pg will be updated in-place
  # (moved from aws_db_instance.ooni_pg)
  ~ resource "aws_db_instance" "pg" {
      ~ db_subnet_group_name                  = "ooni-main" -> "ooni-prod-tier0-postgres-sng"
        id                                    = "db-LT4NDHTMMWPYB4TLALUJMYTZFU"
      ~ identifier                            = "ooni-postgresql-tier0-prod" -> "ooni-prod-tier0-postgres"
      ~ tags                                  = {
          + "Environment" = "prod"
          + "Name"        = "ooni-prod"
          + "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all                              = {
          + "Environment" = "prod"
          + "Name"        = "ooni-prod"
          + "Repository"  = "https://github.com/ooni/devops"
        }
      ~ vpc_security_group_ids                = [
          - "sg-06d7cf832e6855a37",
        ] -> (known after apply)
        # (48 unchanged attributes hidden)
    }

  # module.postgresql.aws_db_subnet_group.pg must be replaced
  # (moved from aws_db_subnet_group.main)
-/+ resource "aws_db_subnet_group" "pg" {
      ~ arn                     = "arn:aws:rds:eu-central-1:082866812839:subgrp:ooni-main" -> (known after apply)
      ~ id                      = "ooni-main" -> (known after apply)
      ~ name                    = "ooni-main" -> "ooni-prod-tier0-postgres-sng" # forces replacement
      + name_prefix             = (known after apply)
      ~ supported_network_types = [
          - "IPV4",
        ] -> (known after apply)
      ~ tags                    = {
          + "Environment" = "prod"
          ~ "Name"        = "Main" -> "ooni-prod"
          + "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all                = {
          + "Environment" = "prod"
          ~ "Name"        = "Main" -> "ooni-prod"
          + "Repository"  = "https://github.com/ooni/devops"
        }
      ~ vpc_id                  = "vpc-08b101405472a0b46" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.postgresql.aws_security_group.pg must be replaced
  # (moved from aws_security_group.pg_sg)
-/+ resource "aws_security_group" "pg" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:082866812839:security-group/sg-06d7cf832e6855a37" -> (known after apply)
      ~ id                     = "sg-06d7cf832e6855a37" -> (known after apply)
      ~ name                   = "ooni-tier0-prod-postgres-sg" -> "ooni-prod-tier0-postgres-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "082866812839" -> (known after apply)
      ~ tags                   = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            "Repository"  = "https://github.com/ooni/devops"
        }
      ~ tags_all               = {
          + "Environment" = "prod"
          ~ "Name"        = "ooni-tier1-production" -> "ooni-prod"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

Plan: 4 to add, 22 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

|                   |                                    |
|-------------------|------------------------------------|
| Pusher            | @hellais               |
| Action            |  pull_request          |
| Working Directory |  ./tf/environments/prod |
| Workflow          |  .github/workflows/check_deploy.yml            |
| Last updated      |  Sat, 09 Mar 2024 14:43:50 GMT   |

    